Revit 2027 API
GroupTypeId.EnergyAnalysisDetailedAndConceptualModels Property
 Essential.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId EnergyAnalysisDetailedAndConceptualModels { get; }
Public Shared ReadOnly Property EnergyAnalysisDetailedAndConceptualModels As ForgeTypeId
	Get
public:
static property ForgeTypeId^ EnergyAnalysisDetailedAndConceptualModels {
	ForgeTypeId^ get ();
}
static member EnergyAnalysisDetailedAndConceptualModels : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace